; domain
(define (domain Depot)
(:requirements :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z))))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depotprob4398) (:domain Depot)
(:objects
	depot0 depot1 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 truck2 truck3 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate5)
	(at pallet1 depot1)
	(clear crate3)
	(at pallet2 distributor0)
	(clear crate4)
	(at pallet3 distributor1)
	(clear pallet3)
	(at pallet4 depot1)
	(clear crate0)
	(at pallet5 distributor1)
	(clear pallet5)
	(at pallet6 depot1)
	(clear pallet6)
	(at pallet7 distributor0)
	(clear pallet7)
	(at truck0 depot1)
	(at truck1 depot1)
	(at truck2 depot0)
	(at truck3 distributor1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 distributor0)
	(available hoist2)
	(at hoist3 distributor1)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 depot1)
	(available hoist5)
	(at hoist6 depot1)
	(available hoist6)
	(at hoist7 distributor1)
	(available hoist7)
	(at crate0 depot1)
	(on crate0 pallet4)
	(at crate1 depot1)
	(on crate1 pallet1)
	(at crate2 depot0)
	(on crate2 pallet0)
	(at crate3 depot1)
	(on crate3 crate1)
	(at crate4 distributor0)
	(on crate4 pallet2)
	(at crate5 depot0)
	(on crate5 crate2)
)

(:goal (and
		(on crate0 pallet3)
		(on crate2 pallet1)
		(on crate3 pallet0)
		(on crate4 crate3)
		(on crate5 pallet2)
	)
)
(:metric minimize (total-time)))

; plan
1. (drive truck2 depot0 distributor0)
   deleted: (at truck2 depot0)
   added: (at truck2 distributor0)
   goals met: 0 of 5
2. (lift hoist1 crate0 pallet4 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist1) (on crate0 pallet4)
   added: (lifting hoist1 crate0) (clear pallet4)
   goals met: 0 of 5
3. (load hoist1 crate0 truck1 depot1)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck1) (available hoist1)
   goals met: 0 of 5
4. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 0 of 5
5. (unload hoist7 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist7)
   added: (lifting hoist7 crate0)
   goals met: 0 of 5
6. (drop hoist7 crate0 pallet3 distributor1)
   deleted: (lifting hoist7 crate0) (clear pallet3)
   added: (available hoist7) (at crate0 distributor1) (clear crate0) (on crate0 pallet3)
   goals met: 1 of 5
7. (lift hoist1 crate3 crate1 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist1) (on crate3 crate1)
   added: (lifting hoist1 crate3) (clear crate1)
   goals met: 1 of 5
8. (load hoist1 crate3 truck0 depot1)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   goals met: 1 of 5
9. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 1 of 5
10. (lift hoist1 crate1 pallet1 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   goals met: 1 of 5
11. (lift hoist0 crate5 crate2 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate2)
   added: (lifting hoist0 crate5) (clear crate2)
   goals met: 1 of 5
12. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   goals met: 1 of 5
13. (lift hoist0 crate2 pallet0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 pallet0)
   added: (lifting hoist0 crate2) (clear pallet0)
   goals met: 1 of 5
14. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   goals met: 1 of 5
15. (unload hoist0 crate3 truck0 depot0)
   deleted: (in crate3 truck0) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 1 of 5
16. (drop hoist0 crate3 pallet0 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet0)
   goals met: 2 of 5
17. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 2 of 5
18. (unload hoist6 crate2 truck0 depot1)
   deleted: (in crate2 truck0) (available hoist6)
   added: (lifting hoist6 crate2)
   goals met: 2 of 5
19. (drop hoist6 crate2 pallet1 depot1)
   deleted: (lifting hoist6 crate2) (clear pallet1)
   added: (available hoist6) (at crate2 depot1) (clear crate2) (on crate2 pallet1)
   goals met: 3 of 5
20. (lift hoist2 crate4 pallet2 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist2) (on crate4 pallet2)
   added: (lifting hoist2 crate4) (clear pallet2)
   goals met: 3 of 5
21. (load hoist2 crate4 truck2 distributor0)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck2) (available hoist2)
   goals met: 3 of 5
22. (drive truck2 distributor0 depot0)
   deleted: (at truck2 distributor0)
   added: (at truck2 depot0)
   goals met: 3 of 5
23. (unload hoist0 crate4 truck2 depot0)
   deleted: (in crate4 truck2) (available hoist0)
   added: (lifting hoist0 crate4)
   goals met: 3 of 5
24. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 3 of 5
25. (unload hoist2 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist2)
   added: (lifting hoist2 crate5)
   goals met: 3 of 5
26. (drop hoist2 crate5 pallet2 distributor0)
   deleted: (lifting hoist2 crate5) (clear pallet2)
   added: (available hoist2) (at crate5 distributor0) (clear crate5) (on crate5 pallet2)
   goals met: 4 of 5
27. (drop hoist0 crate4 crate3 depot0)
   deleted: (lifting hoist0 crate4) (clear crate3)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate3)
   goals met: 5 of 5
